/* Alert Message:  MIDI Learn Reset */
"All MIDI learn knob assignments have been removed." = "All MIDI learn knob assignments have been removed.";

/* Alert Message: MIDI Panic */
"All notes have been turned off." = "All notes have been turned off.";

/* Arpeggiator Off */
"Arp/Sequencer Off" = "Arp/Sequencer Off";

/* Arpeggiator On */
"Arp/Sequencer On" = "Arp/Sequencer On";

/* Arpeggiator Interval */
"Arpeggiator Interval: \(Int(value))" = "Arpeggiator Interval: \(Int(value))";

/* Arpeggiator Mode On */
"Arpeggiator Mode" = "Arpeggiator Mode";

/* AutoPan Rate tempo-syncd */
"AutoPan Rate: \(Rate.fromFrequency(value)), \(value.decimalString) Hz" = "AutoPan Rate: \(Rate.fromFrequency(value)), \(value.decimalString) Hz";

/* AutoPan Rate */
"AutoPan Rate: \(value.decimalString) Hz" = "AutoPan Rate: \(value.decimalString) Hz";

/* AutoPan Amount/Strength */
"AutoPan Strength: \(value.percentageString)" = "AutoPan Strength: \(value.percentageString)";

/* Alert Message: Background Audio */
"Background audio will drain the battery faster. Please turn off when not in use." = "Background audio will drain the battery faster. Please turn off when not in use.";

/* Band Pass Filter */
"Band Pass" = "Band Pass";

/* LFO [low frequency oscillator] Bitcrush */
"Bitcrush LFO ‣ \(lfoSource!)" = "Bitcrush LFO ‣ \(lfoSource!)";

/* LFO [low frequency oscillator] Cutoff */
"Cutoff LFO ‣ \(lfoSource!)" = "Cutoff LFO ‣ \(lfoSource!)";

/* Filter Cutoff & Resonance */
"Cutoff: \(s.getSynthParameter(.cutoff).decimalString) Hz, Resonance: \(s.getSynthParameter(.resonance).decimalString)" = "Cutoff: \(s.getSynthParameter(.cutoff).decimalString) Hz, Resonance: \(s.getSynthParameter(.resonance).decimalString)";

/* Oscillator 1 Waveform Morph Index */
"DCO 1 Morph: \(value.decimalString)" = "DCO 1 Morph: \(value.decimalString)";

/* Oscillator 1 Volume */
"DCO 1 Volume: \(value.percentageString)" = "DCO 1 Volume: \(value.percentageString)";

/* Oscillator 1 semitone offset */
"DCO 1: \(Int(value)) semitones" = "DCO 1: \(Int(value)) semitones";

/* Oscillator 2 Waveform Morph Index */
"DCO 2 Morph: \(value.decimalString)" = "DCO 2 Morph: \(value.decimalString)";

/* Oscillator 2 Volume */
"DCO 2 Volume: \(value.percentageString)" = "DCO 2 Volume: \(value.percentageString)";

/* Oscillator 2 detune */
"DCO 2: \(Int(value)) detune" = "DCO 2: \(Int(value)) detune";

/* Oscillator 2 semitone offset */
"DCO 2: \(Int(value)) semitones" = "DCO 2: \(Int(value)) semitones";

/* Oscillator 1 & 2 Mix */
"DCO Mix: \(Int(value)) detune" = "DCO Mix: \(Int(value)) detune";

/* LFO [low frequency oscillator] Decay */
"Decay LFO ‣ \(lfoSource!)" = "Decay LFO ‣ \(lfoSource!)";

/* Delay Off */
"Delay  Off" = "Delay  Off";

/* Delay Feedback */
"Delay Feedback/Taps: \(value.percentageString)" = "Delay Feedback/Taps: \(value.percentageString)";

/* Delay Mix */
"Delay Mix: \(value.percentageString)" = "Delay Mix: \(value.percentageString)";

/* Delay On */
"Delay On" = "Delay On";

/* Delay Time tempo-syncd */
"Delay Time: \(Rate.fromTime(value)), \(value.decimalString)s" = "Delay Time: \(Rate.fromTime(value)), \(value.decimalString)s";

/* Delay Time */
"Delay Time: \(value.decimalString) s" = "Delay Time: \(value.decimalString) s";

/* LFO [low frequency oscillator] Detune */
"Detune LFO ‣ \(lfoSource!)" = "Detune LFO ‣ \(lfoSource!)";

/* Alert Title: Allows On Mode */
"Don't Sleep Mode" = "Don't Sleep Mode";

/* LFO [low frequency oscillator] Filter Envelope */
"Filter Env LFO ‣ \(lfoSource!)" = "Filter Env LFO ‣ \(lfoSource!)";

/* Filter Envelope Amount */
"Filter Envelope: \(value.percentageString)" = "Filter Envelope: \(value.percentageString)";

/* Main Filter Type */
"Filter Type: \(ftype)" = "Filter Type: \(ftype)";

/* LFO [low frequency oscillator] FM Modulation */
"FM LFO ‣ \(lfoSource!)" = "FM LFO ‣ \(lfoSource!)";

/* FM Modulation Amount */
"FM Mod: \(value.percentageString)" = "FM Mod: \(value.percentageString)";

/* FM Oscillator Volume */
"FM Volume: \(value.percentageString)" = "FM Volume: \(value.percentageString)";

/* Mono Glide Amount */
"Glide: \(value.decimalString)" = "Glide: \(value.decimalString)";

/* High Pass Filter */
"High Pass" = "High Pass";

/* Alert Title: Background Audio */
"Important" = "Important";

/* LFO 2 [low frequency oscillator] Amplitude */
"LFO 2 Amp: \(value.percentageString)" = "LFO 2 Amp: \(value.percentageString)";

/* LFO 2 [low frequency oscillator] Rate tempo-syncd */
"LFO 2 Rate: \(Rate.fromFrequency(value)), \(value.decimalString) Hz" = "LFO 2 Rate: \(Rate.fromFrequency(value)), \(value.decimalString) Hz";

/* LFO 2 [low frequency oscillator] Rate tempo-syncd */
"LFO 2 Rate: \(value.decimalString) Hz" = "LFO 2 Rate: \(value.decimalString) Hz";

/* LFO [low frequency oscillator] Amplitude & Rate tempo-syncd */
"LFO1 Rate: \(Rate.fromFrequency(s.getSynthParameter(.lfo1Rate))), LFO1 Amp: \(s.getSynthParameter(.lfo1Amplitude).percentageString)" = "LFO1 Rate: \(Rate.fromFrequency(s.getSynthParameter(.lfo1Rate))), LFO1 Amp: \(s.getSynthParameter(.lfo1Amplitude).percentageString)";

/* LFO [low frequency oscillator] Amplitude & Rate */
"LFO1 Rate: \(s.getSynthParameter(.lfo1Rate).decimalString)Hz, LFO1 Amp: \(s.getSynthParameter(.lfo1Amplitude).percentageString)" = "LFO1 Rate: \(s.getSynthParameter(.lfo1Rate).decimalString)Hz, LFO1 Amp: \(s.getSynthParameter(.lfo1Amplitude).percentageString)";

/* Low Pass Filter */
"Low Pass" = "Low Pass";

/* Master Volume */
"Master Volume: \(value.percentageString)" = "Master Volume: \(value.percentageString)";

/* MIDI Learn Instructions */
"MIDI Learn Off" = "MIDI Learn Off";

/* Alert Title: MIDI Learn Reset */
"MIDI Learn Reset" = "MIDI Learn Reset";

/* MIDI Learn Instructions */
"MIDI Learn: Touch a knob to assign" = "MIDI Learn: Touch a knob to assign";

/* Alert Message: Too High */
"MIDI Note > 127. G8 is the highest playable key. Take it down a notch 😉" = "MIDI Note > 127. G8 is the highest playable key. Take it down a notch 😉";

/* Alert Title: MIDI Panic */
"Midi Panic" = "Midi Panic";

/* LFO [low frequency oscillator] Noise */
"Noise LFO ‣ \(lfoSource!)" = "Noise LFO ‣ \(lfoSource!)";

/* Noise Volume */
"Noise Volume: \((value * 4).percentageString)" = "Noise Volume: \((value * 4).percentageString)";

/* Alert Title: Duplicate Bank Name */
"Notice" = "Notice";

/* LFO [low frequency oscillator] Oscillator Mix */
"Osc Mix LFO ‣ \(lfoSource!)" = "Osc Mix LFO ‣ \(lfoSource!)";

/* Phaser Feedback */
"Phaser Feedback: \(value.decimalString)" = "Phaser Feedback: \(value.decimalString)";

/* Phaser Mix */
"Phaser Mix: \(value.decimalString)" = "Phaser Mix: \(value.decimalString)";

/* Phaser Notch Width */
"Phaser Notch Width: \(value.decimalString)" = "Phaser Notch Width: \(value.decimalString)";

/* Phaser Rate */
"Phaser Rate: \(value.decimalString)" = "Phaser Rate: \(value.decimalString)";

/* LFO [low frequency oscillator] Pitch */
"Pitch LFO ‣ \(lfoSource!)" = "Pitch LFO ‣ \(lfoSource!)";

/* LFO [low frequency oscillator] Resonance */
"Resonance LFO ‣ \(lfoSource!)" = "Resonance LFO ‣ \(lfoSource!)";

/* Reverb Low-cut/Highpass */
"Reverb Low-cut: \(value.decimalString) Hz" = "Reverb Low-cut: \(value.decimalString) Hz";

/* LFO [low frequency oscillator] Reverb Mix */
"Reverb Mix LFO ‣ \(lfoSource!)" = "Reverb Mix LFO ‣ \(lfoSource!)";

/* Reverb Mix */
"Reverb Mix: \(value.percentageString)" = "Reverb Mix: \(value.percentageString)";

/* Reverb Off */
"Reverb Off" = "Reverb Off";

/* Reverb On */
"Reverb On" = "Reverb On";

/* Reverb Size */
"Reverb Size: \(value.percentageString)" = "Reverb Size: \(value.percentageString)";

/* Bitcrush Sample Rate */
"Sample Rate: \(Int(value)) Hz" = "Sample Rate: \(Int(value)) Hz";

/* Sequencer Mode On */
"Sequencer Mode" = "Sequencer Mode";

/* Alert Title: Allow notifications */
"Stay informed!" = "Stay informed!";

/* Sub Oscillator Volume */
"Sub Osc Volume: \(value.decimalString)" = "Sub Osc Volume: \(value.decimalString)";

/* Tempo (Beats Per Minute) */
"Tempo: \(value) BPM" = "Tempo: \(value) BPM";

/* Alert Title: Rate App */
"Thank you" = "Thank you";

/* Alert Message: Duplicate Bank Name */
"There is already a bank with the name '\(bankName)'. Please rename one of them to keep things working smoothly." = "There is already a bank with the name '\(bankName)'. Please rename one of them to keep things working smoothly.";

/* Alert Message: Rate App */
"This is a FREE app built by volunteers. Please help with a Great rating so we can make more apps! Thanks for being awesome." = "This is a FREE app built by volunteers. Please help with a Great rating so we can make more apps! Thanks for being awesome.";

/* Alert Message: Allows On Mode */
"This mode is great for playing live. Background audio will also stay on. Note: It will use more power and could drain your battery faster" = "This mode is great for playing live. Background audio will also stay on. Note: It will use more power and could drain your battery faster";

/* Alert Title: Too High */
"Too High" = "Too High";

/* LFO [low frequency oscillator] Tremolo */
"Tremolo LFO ‣ \(lfoSource!)" = "Tremolo LFO ‣ \(lfoSource!)";

/* MIDI Learn Instructions */
"Twist knob on your MIDI Controller" = "Twist knob on your MIDI Controller";

/* Alert Message: Allow notifications */
"We'll send Free updates, sounds, and apps. Allow notifications!" = "We'll send Free updates, sounds, and apps. Allow notifications!";

/* Stereo Widen */
"Stereo Widen: \(value.decimalString)" = "Stereo Widen: \(value.decimalString)";

/* Record Button */
"Record" = "Record";

/* Exporting State */
"Exporting" = "Exporting";
